Tutorials-4.1/oscillatingInlet/Allrun.pre
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh

runApplication topoSet -constant

# split the mesh to generate the ACMI coupled patches
runApplication createBaffles -overwrite

cp -rf 0.orig 0
