Tutorials-4.1/oscillatingInlet/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|U|h|p|k|epsilon).*"
    {
        solver          PBiCGStab;
        preconditioner	DILU;
//        solver          smoothSolver;
//        smoother        DILUGaussSeidel;
        tolerance       1e-015;
        relTol          1e-6;
        maxIter         1000;
    }

    pcorr
    {
        solver          GAMG;
        tolerance       0;
        relTol          1e-6;
        smoother        GaussSeidel;
        cacheAgglomeration no;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        maxIter         50;
    }
}

PIMPLE
{
    
    momentumPredictor           false; //true;
    nCorrectors                 2;
    nOuterCorrectors            2;
    nonOrthogonalityThreshold   60;
    skewnessThreshold           0.5;
    updateEnergyInPISO          false;
    fluxScheme                  Kurganov; //Tadmor;
    correctPhi                  true;
    checkMeshCourantNo          true;
    
    kappaFunction
    {
        type standardMachToAcCourantRatio;
        
        standardMachToAcCourantRatioCoeffs
        {
        }
    }
}

// ************************************************************************* //
